name: "my_model"
platform: "tensorflow_savedmodel"
max_batch_size: 1
input [{
    name: "input_1"
    data_type: TYPE_FP32
    dims: [ 224, 224, 3 ]
  }
]
output [{
    name: "act_softmax"
    data_type: TYPE_FP32
    dims: [ 1000 ]
  }
]
instance_group [
    {
        count: 1
        kind: KIND_CPU
    }
]