name: "flowers"
platform: "tensorflow_savedmodel"
input [{
    name: "image_bytes"
    data_type: TYPE_STRING
    dims: [-1]
  },
  {
    name: "key"
    data_type: TYPE_STRING
    dims: [-1]
  }
]
output [{
    name: "key"
    data_type: TYPE_STRING
    dims: [-1]
  },
  {
    name: "prediction"
    data_type: TYPE_INT64
    dims: [-1]
  },
  {
    name: "scores"
    data_type: TYPE_FP32
    dims: [-1, 6]
  }
]
instance_group [
    {
        count: 1
        kind: KIND_CPU
    }
]
