{"class_name": "Model", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 512, 512, 1], "dtype": "float32", "sparse": false, "name": "input"}, "name": "input", "inbound_nodes": []}, {"class_name": "Model", "config": {"name": "encoder", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 512, 512, 1], "dtype": "float32", "sparse": false, "name": "input"}, "name": "input", "inbound_nodes": []}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_55", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_55", "op": "Mul", "input": ["input_1", "mul_55/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 2.0}}, "name": "tf_op_layer_mul_55", "inbound_nodes": [[["input", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "sub_1", "trainable": true, "dtype": "float32", "node_def": {"name": "sub_1", "op": "Sub", "input": ["mul_55", "sub_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 1.0}}, "name": "tf_op_layer_sub_1", "inbound_nodes": [[["tf_op_layer_mul_55", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_60", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [5, 5], "strides": [4, 4], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_60", "inbound_nodes": [[["tf_op_layer_sub_1", 0, 0, {}]]]}, {"class_name": "GroupNormalization", "config": {"name": "group_normalization_51", "trainable": true, "dtype": "float32", "groups": 16, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "group_normalization_51", "inbound_nodes": [[["conv2d_60", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sigmoid_55", "trainable": true, "dtype": "float32", "node_def": {"name": "Sigmoid_55", "op": "Sigmoid", "input": ["group_normalization_51/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Sigmoid_55", "inbound_nodes": [[["group_normalization_51", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_56", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_56", "op": "Mul", "input": ["group_normalization_51/Identity", "Sigmoid_55"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_mul_56", "inbound_nodes": [[["group_normalization_51", 0, 0, {}], ["tf_op_layer_Sigmoid_55", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_61", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_61", "inbound_nodes": [[["tf_op_layer_mul_56", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sigmoid_56", "trainable": true, "dtype": "float32", "node_def": {"name": "Sigmoid_56", "op": "Sigmoid", "input": ["conv2d_61/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Sigmoid_56", "inbound_nodes": [[["conv2d_61", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_57", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_57", "op": "Mul", "input": ["conv2d_61/Identity", "Sigmoid_56"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_mul_57", "inbound_nodes": [[["conv2d_61", 0, 0, {}], ["tf_op_layer_Sigmoid_56", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_62", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_62", "inbound_nodes": [[["tf_op_layer_mul_57", 0, 0, {}]]]}, {"class_name": "GroupNormalization", "config": {"name": "group_normalization_52", "trainable": true, "dtype": "float32", "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "group_normalization_52", "inbound_nodes": [[["conv2d_62", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sigmoid_57", "trainable": true, "dtype": "float32", "node_def": {"name": "Sigmoid_57", "op": "Sigmoid", "input": ["group_normalization_52/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Sigmoid_57", "inbound_nodes": [[["group_normalization_52", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_58", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_58", "op": "Mul", "input": ["group_normalization_52/Identity", "Sigmoid_57"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_mul_58", "inbound_nodes": [[["group_normalization_52", 0, 0, {}], ["tf_op_layer_Sigmoid_57", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_63", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_63", "inbound_nodes": [[["tf_op_layer_mul_58", 0, 0, {}]]]}, {"class_name": "GroupNormalization", "config": {"name": "group_normalization_53", "trainable": true, "dtype": "float32", "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "group_normalization_53", "inbound_nodes": [[["conv2d_63", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_24", "trainable": true, "dtype": "float32", "node_def": {"name": "add_24", "op": "AddV2", "input": ["group_normalization_53/Identity", "conv2d_61/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_24", "inbound_nodes": [[["group_normalization_53", 0, 0, {}], ["conv2d_61", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sigmoid_58", "trainable": true, "dtype": "float32", "node_def": {"name": "Sigmoid_58", "op": "Sigmoid", "input": ["add_24"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Sigmoid_58", "inbound_nodes": [[["tf_op_layer_add_24", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_59", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_59", "op": "Mul", "input": ["add_24", "Sigmoid_58"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_mul_59", "inbound_nodes": [[["tf_op_layer_add_24", 0, 0, {}], ["tf_op_layer_Sigmoid_58", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_65", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_65", "inbound_nodes": [[["tf_op_layer_mul_59", 0, 0, {}]]]}, {"class_name": "GroupNormalization", "config": {"name": "group_normalization_55", "trainable": true, "dtype": "float32", "groups": 24, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "group_normalization_55", "inbound_nodes": [[["conv2d_65", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_64", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_64", "inbound_nodes": [[["tf_op_layer_add_24", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_4", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "average_pooling2d_4", "inbound_nodes": [[["group_normalization_55", 0, 0, {}]]]}, {"class_name": "GroupNormalization", "config": {"name": "group_normalization_54", "trainable": true, "dtype": "float32", "groups": 24, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "group_normalization_54", "inbound_nodes": [[["conv2d_64", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_25", "trainable": true, "dtype": "float32", "node_def": {"name": "add_25", "op": "AddV2", "input": ["average_pooling2d_4/Identity", "group_normalization_54/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_25", "inbound_nodes": [[["average_pooling2d_4", 0, 0, {}], ["group_normalization_54", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sigmoid_59", "trainable": true, "dtype": "float32", "node_def": {"name": "Sigmoid_59", "op": "Sigmoid", "input": ["add_25"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Sigmoid_59", "inbound_nodes": [[["tf_op_layer_add_25", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_60", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_60", "op": "Mul", "input": ["add_25", "Sigmoid_59"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_mul_60", "inbound_nodes": [[["tf_op_layer_add_25", 0, 0, {}], ["tf_op_layer_Sigmoid_59", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_66", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_66", "inbound_nodes": [[["tf_op_layer_mul_60", 0, 0, {}]]]}, {"class_name": "GroupNormalization", "config": {"name": "group_normalization_56", "trainable": true, "dtype": "float32", "groups": 24, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "group_normalization_56", "inbound_nodes": [[["conv2d_66", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sigmoid_60", "trainable": true, "dtype": "float32", "node_def": {"name": "Sigmoid_60", "op": "Sigmoid", "input": ["group_normalization_56/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Sigmoid_60", "inbound_nodes": [[["group_normalization_56", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_61", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_61", "op": "Mul", "input": ["group_normalization_56/Identity", "Sigmoid_60"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_mul_61", "inbound_nodes": [[["group_normalization_56", 0, 0, {}], ["tf_op_layer_Sigmoid_60", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_67", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_67", "inbound_nodes": [[["tf_op_layer_mul_61", 0, 0, {}]]]}, {"class_name": "GroupNormalization", "config": {"name": "group_normalization_57", "trainable": true, "dtype": "float32", "groups": 24, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "group_normalization_57", "inbound_nodes": [[["conv2d_67", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_26", "trainable": true, "dtype": "float32", "node_def": {"name": "add_26", "op": "AddV2", "input": ["group_normalization_57/Identity", "add_25"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_26", "inbound_nodes": [[["group_normalization_57", 0, 0, {}], ["tf_op_layer_add_25", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sigmoid_61", "trainable": true, "dtype": "float32", "node_def": {"name": "Sigmoid_61", "op": "Sigmoid", "input": ["add_26"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Sigmoid_61", "inbound_nodes": [[["tf_op_layer_add_26", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_62", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_62", "op": "Mul", "input": ["add_26", "Sigmoid_61"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_mul_62", "inbound_nodes": [[["tf_op_layer_add_26", 0, 0, {}], ["tf_op_layer_Sigmoid_61", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_69", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_69", "inbound_nodes": [[["tf_op_layer_mul_62", 0, 0, {}]]]}, {"class_name": "GroupNormalization", "config": {"name": "group_normalization_59", "trainable": true, "dtype": "float32", "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "group_normalization_59", "inbound_nodes": [[["conv2d_69", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_68", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_68", "inbound_nodes": [[["tf_op_layer_add_26", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_5", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "average_pooling2d_5", "inbound_nodes": [[["group_normalization_59", 0, 0, {}]]]}, {"class_name": "GroupNormalization", "config": {"name": "group_normalization_58", "trainable": true, "dtype": "float32", "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "group_normalization_58", "inbound_nodes": [[["conv2d_68", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_27", "trainable": true, "dtype": "float32", "node_def": {"name": "add_27", "op": "AddV2", "input": ["average_pooling2d_5/Identity", "group_normalization_58/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_27", "inbound_nodes": [[["average_pooling2d_5", 0, 0, {}], ["group_normalization_58", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sigmoid_62", "trainable": true, "dtype": "float32", "node_def": {"name": "Sigmoid_62", "op": "Sigmoid", "input": ["add_27"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Sigmoid_62", "inbound_nodes": [[["tf_op_layer_add_27", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_63", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_63", "op": "Mul", "input": ["add_27", "Sigmoid_62"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_mul_63", "inbound_nodes": [[["tf_op_layer_add_27", 0, 0, {}], ["tf_op_layer_Sigmoid_62", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_70", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_70", "inbound_nodes": [[["tf_op_layer_mul_63", 0, 0, {}]]]}, {"class_name": "GroupNormalization", "config": {"name": "group_normalization_60", "trainable": true, "dtype": "float32", "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "group_normalization_60", "inbound_nodes": [[["conv2d_70", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sigmoid_63", "trainable": true, "dtype": "float32", "node_def": {"name": "Sigmoid_63", "op": "Sigmoid", "input": ["group_normalization_60/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Sigmoid_63", "inbound_nodes": [[["group_normalization_60", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_64", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_64", "op": "Mul", "input": ["group_normalization_60/Identity", "Sigmoid_63"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_mul_64", "inbound_nodes": [[["group_normalization_60", 0, 0, {}], ["tf_op_layer_Sigmoid_63", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_71", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_71", "inbound_nodes": [[["tf_op_layer_mul_64", 0, 0, {}]]]}, {"class_name": "GroupNormalization", "config": {"name": "group_normalization_61", "trainable": true, "dtype": "float32", "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "group_normalization_61", "inbound_nodes": [[["conv2d_71", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_28", "trainable": true, "dtype": "float32", "node_def": {"name": "add_28", "op": "AddV2", "input": ["group_normalization_61/Identity", "add_27"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_28", "inbound_nodes": [[["group_normalization_61", 0, 0, {}], ["tf_op_layer_add_27", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sigmoid_64", "trainable": true, "dtype": "float32", "node_def": {"name": "Sigmoid_64", "op": "Sigmoid", "input": ["add_28"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Sigmoid_64", "inbound_nodes": [[["tf_op_layer_add_28", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_65", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_65", "op": "Mul", "input": ["add_28", "Sigmoid_64"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_mul_65", "inbound_nodes": [[["tf_op_layer_add_28", 0, 0, {}], ["tf_op_layer_Sigmoid_64", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_73", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_73", "inbound_nodes": [[["tf_op_layer_mul_65", 0, 0, {}]]]}, {"class_name": "GroupNormalization", "config": {"name": "group_normalization_63", "trainable": true, "dtype": "float32", "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "group_normalization_63", "inbound_nodes": [[["conv2d_73", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_72", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_72", "inbound_nodes": [[["tf_op_layer_add_28", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_6", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "average_pooling2d_6", "inbound_nodes": [[["group_normalization_63", 0, 0, {}]]]}, {"class_name": "GroupNormalization", "config": {"name": "group_normalization_62", "trainable": true, "dtype": "float32", "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "group_normalization_62", "inbound_nodes": [[["conv2d_72", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_29", "trainable": true, "dtype": "float32", "node_def": {"name": "add_29", "op": "AddV2", "input": ["average_pooling2d_6/Identity", "group_normalization_62/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_29", "inbound_nodes": [[["average_pooling2d_6", 0, 0, {}], ["group_normalization_62", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sigmoid_65", "trainable": true, "dtype": "float32", "node_def": {"name": "Sigmoid_65", "op": "Sigmoid", "input": ["add_29"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Sigmoid_65", "inbound_nodes": [[["tf_op_layer_add_29", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_66", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_66", "op": "Mul", "input": ["add_29", "Sigmoid_65"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_mul_66", "inbound_nodes": [[["tf_op_layer_add_29", 0, 0, {}], ["tf_op_layer_Sigmoid_65", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_74", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_74", "inbound_nodes": [[["tf_op_layer_mul_66", 0, 0, {}]]]}, {"class_name": "GroupNormalization", "config": {"name": "group_normalization_64", "trainable": true, "dtype": "float32", "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "group_normalization_64", "inbound_nodes": [[["conv2d_74", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sigmoid_66", "trainable": true, "dtype": "float32", "node_def": {"name": "Sigmoid_66", "op": "Sigmoid", "input": ["group_normalization_64/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Sigmoid_66", "inbound_nodes": [[["group_normalization_64", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_67", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_67", "op": "Mul", "input": ["group_normalization_64/Identity", "Sigmoid_66"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_mul_67", "inbound_nodes": [[["group_normalization_64", 0, 0, {}], ["tf_op_layer_Sigmoid_66", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_75", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_75", "inbound_nodes": [[["tf_op_layer_mul_67", 0, 0, {}]]]}, {"class_name": "GroupNormalization", "config": {"name": "group_normalization_65", "trainable": true, "dtype": "float32", "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "group_normalization_65", "inbound_nodes": [[["conv2d_75", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_30", "trainable": true, "dtype": "float32", "node_def": {"name": "add_30", "op": "AddV2", "input": ["group_normalization_65/Identity", "add_29"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_30", "inbound_nodes": [[["group_normalization_65", 0, 0, {}], ["tf_op_layer_add_29", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sigmoid_67", "trainable": true, "dtype": "float32", "node_def": {"name": "Sigmoid_67", "op": "Sigmoid", "input": ["add_30"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Sigmoid_67", "inbound_nodes": [[["tf_op_layer_add_30", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_68", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_68", "op": "Mul", "input": ["add_30", "Sigmoid_67"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_mul_68", "inbound_nodes": [[["tf_op_layer_add_30", 0, 0, {}], ["tf_op_layer_Sigmoid_67", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_77", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_77", "inbound_nodes": [[["tf_op_layer_mul_68", 0, 0, {}]]]}, {"class_name": "GroupNormalization", "config": {"name": "group_normalization_67", "trainable": true, "dtype": "float32", "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "group_normalization_67", "inbound_nodes": [[["conv2d_77", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_76", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_76", "inbound_nodes": [[["tf_op_layer_add_30", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_7", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "average_pooling2d_7", "inbound_nodes": [[["group_normalization_67", 0, 0, {}]]]}, {"class_name": "GroupNormalization", "config": {"name": "group_normalization_66", "trainable": true, "dtype": "float32", "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "group_normalization_66", "inbound_nodes": [[["conv2d_76", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_31", "trainable": true, "dtype": "float32", "node_def": {"name": "add_31", "op": "AddV2", "input": ["average_pooling2d_7/Identity", "group_normalization_66/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_31", "inbound_nodes": [[["average_pooling2d_7", 0, 0, {}], ["group_normalization_66", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sigmoid_68", "trainable": true, "dtype": "float32", "node_def": {"name": "Sigmoid_68", "op": "Sigmoid", "input": ["add_31"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Sigmoid_68", "inbound_nodes": [[["tf_op_layer_add_31", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_69", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_69", "op": "Mul", "input": ["add_31", "Sigmoid_68"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_mul_69", "inbound_nodes": [[["tf_op_layer_add_31", 0, 0, {}], ["tf_op_layer_Sigmoid_68", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_78", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_78", "inbound_nodes": [[["tf_op_layer_mul_69", 0, 0, {}]]]}, {"class_name": "GroupNormalization", "config": {"name": "group_normalization_68", "trainable": true, "dtype": "float32", "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "group_normalization_68", "inbound_nodes": [[["conv2d_78", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sigmoid_69", "trainable": true, "dtype": "float32", "node_def": {"name": "Sigmoid_69", "op": "Sigmoid", "input": ["group_normalization_68/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Sigmoid_69", "inbound_nodes": [[["group_normalization_68", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_70", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_70", "op": "Mul", "input": ["group_normalization_68/Identity", "Sigmoid_69"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_mul_70", "inbound_nodes": [[["group_normalization_68", 0, 0, {}], ["tf_op_layer_Sigmoid_69", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_79", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_79", "inbound_nodes": [[["tf_op_layer_mul_70", 0, 0, {}]]]}, {"class_name": "GroupNormalization", "config": {"name": "group_normalization_69", "trainable": true, "dtype": "float32", "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "group_normalization_69", "inbound_nodes": [[["conv2d_79", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_32", "trainable": true, "dtype": "float32", "node_def": {"name": "add_32", "op": "AddV2", "input": ["group_normalization_69/Identity", "add_31"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_32", "inbound_nodes": [[["group_normalization_69", 0, 0, {}], ["tf_op_layer_add_31", 0, 0, {}]]]}, {"class_name": "GroupNormalization", "config": {"name": "group_normalization_70", "trainable": true, "dtype": "float32", "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "group_normalization_70", "inbound_nodes": [[["tf_op_layer_add_32", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sigmoid_70", "trainable": true, "dtype": "float32", "node_def": {"name": "Sigmoid_70", "op": "Sigmoid", "input": ["group_normalization_70/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Sigmoid_70", "inbound_nodes": [[["group_normalization_70", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_71", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_71", "op": "Mul", "input": ["group_normalization_70/Identity", "Sigmoid_70"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_mul_71", "inbound_nodes": [[["group_normalization_70", 0, 0, {}], ["tf_op_layer_Sigmoid_70", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_80", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [8, 8], "strides": [8, 8], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_80", "inbound_nodes": [[["tf_op_layer_mul_71", 0, 0, {}]]]}, {"class_name": "GroupNormalization", "config": {"name": "group_normalization_71", "trainable": true, "dtype": "float32", "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "group_normalization_71", "inbound_nodes": [[["conv2d_80", 0, 0, {}]]]}, {"class_name": "GroupNormalization", "config": {"name": "group_normalization_72", "trainable": true, "dtype": "float32", "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "group_normalization_72", "inbound_nodes": [[["conv2d_80", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sigmoid_71", "trainable": true, "dtype": "float32", "node_def": {"name": "Sigmoid_71", "op": "Sigmoid", "input": ["group_normalization_71/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Sigmoid_71", "inbound_nodes": [[["group_normalization_71", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sigmoid_72", "trainable": true, "dtype": "float32", "node_def": {"name": "Sigmoid_72", "op": "Sigmoid", "input": ["group_normalization_72/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Sigmoid_72", "inbound_nodes": [[["group_normalization_72", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_72", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_72", "op": "Mul", "input": ["group_normalization_71/Identity", "Sigmoid_71"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_mul_72", "inbound_nodes": [[["group_normalization_71", 0, 0, {}], ["tf_op_layer_Sigmoid_71", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_73", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_73", "op": "Mul", "input": ["group_normalization_72/Identity", "Sigmoid_72"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_mul_73", "inbound_nodes": [[["group_normalization_72", 0, 0, {}], ["tf_op_layer_Sigmoid_72", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_81", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_81", "inbound_nodes": [[["tf_op_layer_mul_72", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_82", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_82", "inbound_nodes": [[["tf_op_layer_mul_73", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "latent", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABQAAAAUAAABDAAAAczQAAAB8AFwCfQF9AnQAoAF8AaEBfQN0AGoCfANkAY0BfQR8\nAXQAoANkAnwCFAChAXwEFAAXAFMAKQP6zlJlcGFyYW1ldGVyaXphdGlvbiB0cmljayBieSBzYW1w\nbGluZyBmcm9tIGFuIGlzb3Ryb3BpYyB1bml0IEdhdXNzaWFuLgoKICAgICMgQXJndW1lbnRzCiAg\nICAgICAgYXJncyAodGVuc29yKTogbWVhbiBhbmQgbG9nIG9mIHZhcmlhbmNlIG9mIFEoenxYKQoK\nICAgICMgUmV0dXJucwogICAgICAgIHogKHRlbnNvcik6IHNhbXBsZWQgbGF0ZW50IHZlY3Rvcgog\nICAgKQHaBXNoYXBlZwAAAAAAAOA/KQTaAUtyAgAAANoNcmFuZG9tX25vcm1hbNoDZXhwKQXaBGFy\nZ3PaBnpfbWVhbtoJel9sb2dfdmFy2gd6X3NoYXBl2gdlcHNpbG9uqQByCwAAAPpEL1VzZXJzL21v\na3BvbGFyL0RvY3VtZW50cy9HaXRIdWIva3ViZWZsb3cvbW9kZWxfZGVmaW5pdGlvbl9oZWxwZXIu\ncHnaCHNhbXBsaW5nDwAAAHMIAAAAAAkIAQoCDAE=\n", null, null], "function_type": "lambda", "module": "model_definition_helper", "output_shape": [1, 1, 512], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "latent", "inbound_nodes": [[["conv2d_81", 0, 0, {}], ["conv2d_82", 0, 0, {}]]]}], "input_layers": [["input", 0, 0]], "output_layers": [["latent", 0, 0], ["conv2d_81", 0, 0], ["conv2d_82", 0, 0]]}, "name": "encoder", "inbound_nodes": [[["input", 0, 0, {}]]]}, {"class_name": "Model", "config": {"name": "decoder", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 1, 512], "dtype": "float32", "sparse": false, "name": "dec_input"}, "name": "dec_input", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_83", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_83", "inbound_nodes": [[["dec_input", 0, 0, {}]]]}, {"class_name": "GroupNormalization", "config": {"name": "group_normalization_73", "trainable": true, "dtype": "float32", "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "group_normalization_73", "inbound_nodes": [[["conv2d_83", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sigmoid_73", "trainable": true, "dtype": "float32", "node_def": {"name": "Sigmoid_73", "op": "Sigmoid", "input": ["group_normalization_73/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Sigmoid_73", "inbound_nodes": [[["group_normalization_73", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_74", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_74", "op": "Mul", "input": ["group_normalization_73/Identity", "Sigmoid_73"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_mul_74", "inbound_nodes": [[["group_normalization_73", 0, 0, {}], ["tf_op_layer_Sigmoid_73", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_84", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_84", "inbound_nodes": [[["tf_op_layer_mul_74", 0, 0, {}]]]}, {"class_name": "GroupNormalization", "config": {"name": "group_normalization_74", "trainable": true, "dtype": "float32", "groups": 32, "axis": -1, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "group_normalization_74", "inbound_nodes": [[["conv2d_84", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sigmoid_74", "trainable": true, "dtype": "float32", "node_def": {"name": "Sigmoid_74", "op": "Sigmoid", "input": ["group_normalization_74/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Sigmoid_74", "inbound_nodes": [[["group_normalization_74", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_75", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_75", "op": "Mul", "input": ["group_normalization_74/Identity", "Sigmoid_74"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_mul_75", "inbound_nodes": [[["group_normalization_74", 0, 0, {}], ["tf_op_layer_Sigmoid_74", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_85", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, 